Repository: LinkNacional/lknwp-radio-browser
Catalog: Languages/lknwp-radio-browser-*.po
Languages: pt_br

source: Fallback: Could not copy
pt_br: Fallback: Não foi possível copiar

source: Button not found or invalid
pt_br: Botão não encontrado ou inválido

source: Copied!
pt_br: Copiado!

source: Click to copy shortcode
pt_br: Clique para copiar shortcode

source: Copy error:
pt_br: Erro de cópia:

source: Fallback: Error copying
pt_br: Fallback: Erro ao copiar

source: Most popular
pt_br: Mais populares

source: Name
pt_br: Nome

source: Random
pt_br: Aleatório

source: LKN Radio Browser - How to Use
pt_br: LKN Radio Browser - Como Usar

source: 🚀 Plugin Structure & Setup
pt_br: 🚀 Estrutura & Configuração do Plugin

source: This plugin is divided into two main shortcodes:
pt_br: Este plugin está dividido em dois principais shortcodes:

source: Radio Player Shortcode: Displays the radio player.
pt_br: Shortcode do Reprodutor de Rádio: Exibe o reprodutor de rádio.

source: Radio List Shortcode: Displays a list of radios.
pt_br: Shortcode da Lista de Rádios: Exibe uma lista de rádios.

source: Step 1: Create the Player Page
pt_br: Passo 1: Crie a Página do Reprodutor

source: Go to Pages > Add New.
pt_br: Vá para Páginas > Adicionar Nova.

source: Create a page for the radio player.
pt_br: Crie uma página para o reprodutor de rádio.

source: Add the shortcode for the player (see below for usage).
pt_br: Adicione o shortcode para o reprodutor (veja o uso abaixo).

source: Save the page.
pt_br: Salve a página.

source: Step 2: Create the List Page
pt_br: Passo 2: Crie a Página da Lista

source: Create a page to list the radios.
pt_br: Crie uma página para listar as rádios.

source: Add the radio list shortcode: [radio_browser_list player_page="player-page"] (replace "player-page" with the actual slug of your player page).
pt_br: Adicione o shortcode da lista de rádios: [radio_browser_list player_page="player-page"] (substitua "player-page" pelo slug real da sua página do reprodutor).

source: Example:
pt_br: Exemplo:

source: Another Example:
pt_br: Outro Exemplo:

source: 🎵 Radio Player Shortcode
pt_br: 🎵 Shortcode do Player de Rádio

source: Use this shortcode to display the radio player on a specific page:
pt_br: Use este shortcode para exibir o player de rádio em uma página específica:

source: Copy
pt_br: Copiar

source: 📋 How it works:
pt_br: 📋 Como funciona:

source: Create a page (e.g., "Player" with slug "player")
pt_br: Crie uma página (ex: "Player" com slug "player")

source: Add the shortcode
pt_br: Adicionar o shortcode

source: The player will automatically receive URL parameters
pt_br: O player irá automaticamente receber parâmetros de URL

source: Works with links from the radio list
pt_br: Funciona com links da lista de rádio

source: 📻 Radio List Shortcode
pt_br: 📻 Shortcode da Lista de Rádios

source: Use this shortcode to display a list of radios with filters:
pt_br: Use este shortcode para exibir uma lista de rádios com filtros:

source: ⚙️ Basic Parameters:
pt_br: ⚙️ Parâmetros Básicos:

source: Player page slug (required)
pt_br: Player page slug (obrigatório)

source: Country code (BR, US, FR, etc.)
pt_br: Código do país (BR, US, FR, etc.)

source: Number of radios to display
pt_br: Número de rádios para exibir

source: Sort order (clickcount, name, random, bitrate)
pt_br: Ordem de classificação (clickcount, name, random, bitrate)

source: Reverse order (1 or 0)
pt_br: Ordem inversa (1 ou 0)

source: Search term
pt_br: Termo de pesquisa

source: 🎛️ Parameters to Hide Filters:
pt_br: 🎛️ Parâmetros para Ocultar Filtros:

source: Hide Country field
pt_br: Ocultar Campo País

source: or
pt_br: ou

source: Hide Limit field
pt_br: Ocultar Campo Limite

source: Hide Sort field
pt_br: Ocultar Campo Ordenar

source: Hide Order button
pt_br: Ocultar botão Ordem

source: Hide Search field
pt_br: Ocultar Campo Pesquisar

source: Hide Search button
pt_br: Ocultar botão Pesquisar

source: Hide all filters
pt_br: Ocultar todos os filtros

source: 💡 Usage Examples
pt_br: 💡 Exemplos de Uso

source: Complete list with filters (default):
pt_br: Lista completa com filtros (padrão):

source: Clean list without filters:
pt_br: Lista limpa sem filtros:

source: Text search only:
pt_br: Apenas pesquisa de texto:

source: Fixed configuration (US radios, 10 stations, no filters):
pt_br: Configuração fixa (rádios US, 10 estações, sem filtros):

source: List sorted by name (alphabetical):
pt_br: Lista ordenada por nome (alfabética):

source: Country
pt_br: País

source: All Countries
pt_br: Todos os Países

source: Limit
pt_br: Limite

source: Genre
pt_br: Gênero

source: All Genres
pt_br: Todos os Gêneros

source: Sort
pt_br: Ordenar

source: Order
pt_br: Ordem

source: Descending
pt_br: Decrescente

source: Ascending
pt_br: Crescente

source: Search Radio
pt_br: Pesquisar Rádio

source: Search radio...
pt_br: Pesquisar rádio...

source: Search
pt_br: Pesquisar

source: No radios found.
pt_br: Nenhuma rádio encontrada.

source: Radio logo
pt_br: Logotipo da rádio

source: Warning:
pt_br: Aviso:

source: No radio stream found. Please select a radio from the list.
pt_br: Nenhuma stream de rádio encontrada. Por favor, selecione uma rádio da lista.

source: Online Radio
pt_br: Rádio Online

source: Copy link
pt_br: Copiar link

source: Share on Instagram
pt_br: Compartilhar no Instagram

source: Share on WhatsApp
pt_br: Compartilhar no WhatsApp

source: Share on Twitter
pt_br: Compartilhar no Twitter

source: Loading...
pt_br: Carregando...

source: Unable to play this radio station. Please try again later or choose another station.
pt_br: Não foi possível reproduzir esta estação de rádio. Tente novamente mais tarde ou escolha outra estação.

source: 🎵 Listening to {station} -
pt_br: 🎵 A ouvir {station} -

source: Warning: This radio uses insecure streaming (HTTP) and cannot be played on HTTPS pages. Ask the provider to enable HTTPS or access via HTTP.
pt_br: Aviso: Esta rádio usa streaming inseguro (HTTP) e não pode ser reproduzida em páginas HTTPS. Peça ao provedor para habilitar HTTPS ou acesse via HTTP.

source: listeners
pt_br: ouvintes

source: No song found in JSON
pt_br: Nenhuma música encontrada no JSON

source: No song found in HTML
pt_br: Nenhuma música encontrada no HTML

source: Response is not JSON
pt_br: Resposta não é JSON

source: Detected audio component
pt_br: Componente de áudio detectado

source: CORS_BLOCKED: Opaque response, cannot read content
pt_br: CORS_BLOCKED: Resposta opaca, não é possível ler o conteúdo

source: NETWORK_ERROR: Status 0, possible network or CORS issue
pt_br: NETWORK_ERROR: Status 0, possível problema de rede ou CORS

source: AUDIO_STREAM: Response is an audio stream
pt_br: AUDIO_STREAM: Resposta é uma stream de áudio

source: TEXT_TIMEOUT: Text conversion exceeded 5 seconds
pt_br: TEXT_TIMEOUT: A conversão de texto excedeu 5 segundos

source: Content-Type is not JSON:
pt_br: Content-Type não é JSON:

source: Loading radios...
pt_br: Carregando rádios...

source: Trying alternative servers...
pt_br: Tentando servidores alternativos...

source: Error querying API.
pt_br: Erro ao consultar API.

source: Select genre
pt_br: Selecione o Gênero
